zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_RXLUT.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_RXLUT.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_RXLUT
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_RXLUT_H_)  /* Check if memory map has not been already included */
#define S32K566_RXLUT_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- RXLUT Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RXLUT_Peripheral_Access_Layer RXLUT Peripheral Access Layer
 * @{
 */

/** RXLUT - Size of Registers Arrays */
#define RXLUT_RLSOIXR_COUNT                       17u
#define RXLUT_RLSOFSR_COUNT                       3u

/** RXLUT - Register Layout Typedef */
typedef struct RXLUT_Struct {
  __IO uint32_t RLCR;                              /**< RXLUT Configuration, offset: 0x0 */
  __IO uint32_t RLSR;                              /**< RXLUT Status, offset: 0x4 */
  uint8_t RESERVED_0[8];
  __IO uint32_t RLSRIER;                           /**< RXLUT Search Result Interrupt Enable, offset: 0x10 */
  uint8_t RESERVED_1[12];
  __IO uint32_t RLSRISR;                           /**< RXLUT Search Result Interrupt Status, offset: 0x20 */
  uint8_t RESERVED_2[12];
  __IO uint32_t RLFIMER;                           /**< RXLUT Frame ID End, offset: 0x30 */
  __IO uint32_t RLFISR;                            /**< RXLUT Frame ID Start, offset: 0x34 */
  __IO uint32_t RLCIXR;                            /**< RXLUT Channel ID and Index, offset: 0x38 */
  __IO uint32_t RLADRCR;                           /**< RXLUT Address and Command, offset: 0x3C */
  __I  uint32_t RLFIMESR;                          /**< RXLUT Frame ID End Status, offset: 0x40 */
  __I  uint32_t RLFISSR;                           /**< RXLUT Frame ID Start Status, offset: 0x44 */
  __I  uint32_t RLCIXSR;                           /**< RXLUT Channel ID and Index Status, offset: 0x48 */
  __I  uint32_t RLADRSR;                           /**< RXLUT Address Status, offset: 0x4C */
  __I  uint32_t RLSRSR;                            /**< RXLUT Search Result Status, offset: 0x50 */
  __IO uint32_t RLIER;                             /**< RXLUT Interrupt Enable, offset: 0x54 */
  __IO uint32_t RLISR;                             /**< RXLUT Interrupt Status, offset: 0x58 */
  __I  uint32_t RLSR1;                             /**< RXLUT Status Register 1, offset: 0x5C */
  __IO uint32_t RLSICR;                            /**< RXLUT Search Input Command, offset: 0x60 */
  __IO uint32_t RLSICFIR;                          /**< RXLUT Search Input Command Frame ID, offset: 0x64 */
  uint8_t RESERVED_3[24];
  struct RXLUT_RLSOIXR {                           /* offset: 0x80, array step: 0x8 */
    __I  uint32_t RLSOIXR;                           /**< RXLUT Search Output, array offset: 0x80, array step: 0x8 */
    __I  uint32_t RLSOADR;                           /**< RXLUT Search Output Address, array offset: 0x84, array step: 0x8 */
  } RLSOIXR[RXLUT_RLSOIXR_COUNT];
  uint8_t RESERVED_4[1096];
  __I  uint32_t RLSICFSR;                          /**< RXLUT Search Input Command FIFO Status, offset: 0x550 */
  __I  uint32_t RLSOFSR[RXLUT_RLSOFSR_COUNT];      /**< RXLUT Search Output FIFO Status, array offset: 0x554, array step: 0x4 */
  uint8_t RESERVED_5[112];
  __IO uint32_t RLER;                              /**< RXLUT Error, offset: 0x5D0 */
  uint8_t RESERVED_6[12];
  __IO uint32_t RLOOR;                             /**< RXLUT Output Overflow, offset: 0x5E0 */
} RXLUT_Type, *RXLUT_MemMapPtr;

/** Number of instances of the RXLUT module. */
#define RXLUT_INSTANCE_COUNT                     (1u)

/* RXLUT - Peripheral instance base addresses */
/** Peripheral RXLUT base address */
#define IP_RXLUT_BASE                            (0x402E8000u)
/** Peripheral RXLUT base pointer */
#define IP_RXLUT                                 ((RXLUT_Type *)IP_RXLUT_BASE)
/** Array initializer of RXLUT peripheral base addresses */
#define IP_RXLUT_BASE_ADDRS                      { IP_RXLUT_BASE }
/** Array initializer of RXLUT peripheral base pointers */
#define IP_RXLUT_BASE_PTRS                       { IP_RXLUT }

/* ----------------------------------------------------------------------------
   -- RXLUT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RXLUT_Register_Masks RXLUT Register Masks
 * @{
 */

