zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_RXLUT.h
/*! @name RLCR - RXLUT Configuration */
/*! @{ */

#define RXLUT_RLCR_RXLEN_MASK                    (0x1U)
#define RXLUT_RLCR_RXLEN_SHIFT                   (0U)
#define RXLUT_RLCR_RXLEN_WIDTH                   (1U)
#define RXLUT_RLCR_RXLEN(x)                      (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCR_RXLEN_SHIFT)) & RXLUT_RLCR_RXLEN_MASK)

#define RXLUT_RLCR_SRCH_EN_MASK                  (0x2U)
#define RXLUT_RLCR_SRCH_EN_SHIFT                 (1U)
#define RXLUT_RLCR_SRCH_EN_WIDTH                 (1U)
#define RXLUT_RLCR_SRCH_EN(x)                    (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCR_SRCH_EN_SHIFT)) & RXLUT_RLCR_SRCH_EN_MASK)

#define RXLUT_RLCR_PS_EN_MASK                    (0x4U)
#define RXLUT_RLCR_PS_EN_SHIFT                   (2U)
#define RXLUT_RLCR_PS_EN_WIDTH                   (1U)
#define RXLUT_RLCR_PS_EN(x)                      (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCR_PS_EN_SHIFT)) & RXLUT_RLCR_PS_EN_MASK)

#define RXLUT_RLCR_SOVR_MASK                     (0x8U)
#define RXLUT_RLCR_SOVR_SHIFT                    (3U)
#define RXLUT_RLCR_SOVR_WIDTH                    (1U)
#define RXLUT_RLCR_SOVR(x)                       (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCR_SOVR_SHIFT)) & RXLUT_RLCR_SOVR_MASK)

#define RXLUT_RLCR_FLUSH_MASK                    (0x10U)
#define RXLUT_RLCR_FLUSH_SHIFT                   (4U)
#define RXLUT_RLCR_FLUSH_WIDTH                   (1U)
#define RXLUT_RLCR_FLUSH(x)                      (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCR_FLUSH_SHIFT)) & RXLUT_RLCR_FLUSH_MASK)

#define RXLUT_RLCR_ECC_EN_MASK                   (0x20U)
#define RXLUT_RLCR_ECC_EN_SHIFT                  (5U)
#define RXLUT_RLCR_ECC_EN_WIDTH                  (1U)
#define RXLUT_RLCR_ECC_EN(x)                     (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCR_ECC_EN_SHIFT)) & RXLUT_RLCR_ECC_EN_MASK)

#define RXLUT_RLCR_FID_RAR_EN_MASK               (0x40U)
#define RXLUT_RLCR_FID_RAR_EN_SHIFT              (6U)
#define RXLUT_RLCR_FID_RAR_EN_WIDTH              (1U)
#define RXLUT_RLCR_FID_RAR_EN(x)                 (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCR_FID_RAR_EN_SHIFT)) & RXLUT_RLCR_FID_RAR_EN_MASK)

#define RXLUT_RLCR_SOFTRST_MASK                  (0x80000000U)
#define RXLUT_RLCR_SOFTRST_SHIFT                 (31U)
#define RXLUT_RLCR_SOFTRST_WIDTH                 (1U)
#define RXLUT_RLCR_SOFTRST(x)                    (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCR_SOFTRST_SHIFT)) & RXLUT_RLCR_SOFTRST_MASK)
/*! @} */

/*! @name RLSR - RXLUT Status */
/*! @{ */

#define RXLUT_RLSR_BUSY_MASK                     (0x1U)
#define RXLUT_RLSR_BUSY_SHIFT                    (0U)
#define RXLUT_RLSR_BUSY_WIDTH                    (1U)
#define RXLUT_RLSR_BUSY(x)                       (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSR_BUSY_SHIFT)) & RXLUT_RLSR_BUSY_MASK)

#define RXLUT_RLSR_FLUSH_MASK                    (0x2U)
#define RXLUT_RLSR_FLUSH_SHIFT                   (1U)
#define RXLUT_RLSR_FLUSH_WIDTH                   (1U)
#define RXLUT_RLSR_FLUSH(x)                      (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSR_FLUSH_SHIFT)) & RXLUT_RLSR_FLUSH_MASK)

#define RXLUT_RLSR_PENDS_MASK                    (0x4U)
#define RXLUT_RLSR_PENDS_SHIFT                   (2U)
#define RXLUT_RLSR_PENDS_WIDTH                   (1U)
#define RXLUT_RLSR_PENDS(x)                      (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSR_PENDS_SHIFT)) & RXLUT_RLSR_PENDS_MASK)

#define RXLUT_RLSR_MS_MASK                       (0x8U)
#define RXLUT_RLSR_MS_SHIFT                      (3U)
#define RXLUT_RLSR_MS_WIDTH                      (1U)
#define RXLUT_RLSR_MS(x)                         (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSR_MS_SHIFT)) & RXLUT_RLSR_MS_MASK)
/*! @} */

/*! @name RLSRIER - RXLUT Search Result Interrupt Enable */
/*! @{ */

#define RXLUT_RLSRIER_AVLIE_MASK                 (0x1FFFFU)
#define RXLUT_RLSRIER_AVLIE_SHIFT                (0U)
#define RXLUT_RLSRIER_AVLIE_WIDTH                (17U)
#define RXLUT_RLSRIER_AVLIE(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSRIER_AVLIE_SHIFT)) & RXLUT_RLSRIER_AVLIE_MASK)
/*! @} */

/*! @name RLSRISR - RXLUT Search Result Interrupt Status */
/*! @{ */

#define RXLUT_RLSRISR_AVL_MASK                   (0x1FFFFU)
#define RXLUT_RLSRISR_AVL_SHIFT                  (0U)
#define RXLUT_RLSRISR_AVL_WIDTH                  (17U)
#define RXLUT_RLSRISR_AVL(x)                     (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSRISR_AVL_SHIFT)) & RXLUT_RLSRISR_AVL_MASK)
/*! @} */

/*! @name RLFIMER - RXLUT Frame ID End */
/*! @{ */

#define RXLUT_RLFIMER_FIME_MASK                  (0xFFFFFFFFU)
#define RXLUT_RLFIMER_FIME_SHIFT                 (0U)
#define RXLUT_RLFIMER_FIME_WIDTH                 (32U)
#define RXLUT_RLFIMER_FIME(x)                    (((uint32_t)(((uint32_t)(x)) << RXLUT_RLFIMER_FIME_SHIFT)) & RXLUT_RLFIMER_FIME_MASK)
/*! @} */

/*! @name RLFISR - RXLUT Frame ID Start */
/*! @{ */

#define RXLUT_RLFISR_FIS_MASK                    (0xFFFFFFFFU)
#define RXLUT_RLFISR_FIS_SHIFT                   (0U)
#define RXLUT_RLFISR_FIS_WIDTH                   (32U)
#define RXLUT_RLFISR_FIS(x)                      (((uint32_t)(((uint32_t)(x)) << RXLUT_RLFISR_FIS_SHIFT)) & RXLUT_RLFISR_FIS_MASK)
/*! @} */

/*! @name RLCIXR - RXLUT Channel ID and Index */
/*! @{ */

#define RXLUT_RLCIXR_SRCH_MASK                   (0x1U)
#define RXLUT_RLCIXR_SRCH_SHIFT                  (0U)
#define RXLUT_RLCIXR_SRCH_WIDTH                  (1U)
#define RXLUT_RLCIXR_SRCH(x)                     (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCIXR_SRCH_SHIFT)) & RXLUT_RLCIXR_SRCH_MASK)

#define RXLUT_RLCIXR_ENABLE_MASK                 (0x2U)
#define RXLUT_RLCIXR_ENABLE_SHIFT                (1U)
#define RXLUT_RLCIXR_ENABLE_WIDTH                (1U)
#define RXLUT_RLCIXR_ENABLE(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCIXR_ENABLE_SHIFT)) & RXLUT_RLCIXR_ENABLE_MASK)

#define RXLUT_RLCIXR_CID_MASK                    (0xFCU)
#define RXLUT_RLCIXR_CID_SHIFT                   (2U)
#define RXLUT_RLCIXR_CID_WIDTH                   (6U)
#define RXLUT_RLCIXR_CID(x)                      (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCIXR_CID_SHIFT)) & RXLUT_RLCIXR_CID_MASK)

#define RXLUT_RLCIXR_CTRL_MASK                   (0x300U)
#define RXLUT_RLCIXR_CTRL_SHIFT                  (8U)
#define RXLUT_RLCIXR_CTRL_WIDTH                  (2U)
#define RXLUT_RLCIXR_CTRL(x)                     (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCIXR_CTRL_SHIFT)) & RXLUT_RLCIXR_CTRL_MASK)

#define RXLUT_RLCIXR_INDX_MASK                   (0xFFFF0000U)
#define RXLUT_RLCIXR_INDX_SHIFT                  (16U)
#define RXLUT_RLCIXR_INDX_WIDTH                  (16U)
#define RXLUT_RLCIXR_INDX(x)                     (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCIXR_INDX_SHIFT)) & RXLUT_RLCIXR_INDX_MASK)
/*! @} */

/*! @name RLADRCR - RXLUT Address and Command */
/*! @{ */

#define RXLUT_RLADRCR_ADDR_MASK                  (0xFFFFU)
#define RXLUT_RLADRCR_ADDR_SHIFT                 (0U)
#define RXLUT_RLADRCR_ADDR_WIDTH                 (16U)
#define RXLUT_RLADRCR_ADDR(x)                    (((uint32_t)(((uint32_t)(x)) << RXLUT_RLADRCR_ADDR_SHIFT)) & RXLUT_RLADRCR_ADDR_MASK)

