zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_RXLUT.h
#define RXLUT_RLADRCR_CMD_MASK                   (0x10000U)
#define RXLUT_RLADRCR_CMD_SHIFT                  (16U)
#define RXLUT_RLADRCR_CMD_WIDTH                  (1U)
#define RXLUT_RLADRCR_CMD(x)                     (((uint32_t)(((uint32_t)(x)) << RXLUT_RLADRCR_CMD_SHIFT)) & RXLUT_RLADRCR_CMD_MASK)
/*! @} */

/*! @name RLFIMESR - RXLUT Frame ID End Status */
/*! @{ */

#define RXLUT_RLFIMESR_FIMES_MASK                (0xFFFFFFFFU)
#define RXLUT_RLFIMESR_FIMES_SHIFT               (0U)
#define RXLUT_RLFIMESR_FIMES_WIDTH               (32U)
#define RXLUT_RLFIMESR_FIMES(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLFIMESR_FIMES_SHIFT)) & RXLUT_RLFIMESR_FIMES_MASK)
/*! @} */

/*! @name RLFISSR - RXLUT Frame ID Start Status */
/*! @{ */

#define RXLUT_RLFISSR_FISS_MASK                  (0xFFFFFFFFU)
#define RXLUT_RLFISSR_FISS_SHIFT                 (0U)
#define RXLUT_RLFISSR_FISS_WIDTH                 (32U)
#define RXLUT_RLFISSR_FISS(x)                    (((uint32_t)(((uint32_t)(x)) << RXLUT_RLFISSR_FISS_SHIFT)) & RXLUT_RLFISSR_FISS_MASK)
/*! @} */

/*! @name RLCIXSR - RXLUT Channel ID and Index Status */
/*! @{ */

#define RXLUT_RLCIXSR_ENABLE_MASK                (0x2U)
#define RXLUT_RLCIXSR_ENABLE_SHIFT               (1U)
#define RXLUT_RLCIXSR_ENABLE_WIDTH               (1U)
#define RXLUT_RLCIXSR_ENABLE(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCIXSR_ENABLE_SHIFT)) & RXLUT_RLCIXSR_ENABLE_MASK)

#define RXLUT_RLCIXSR_CIDS_MASK                  (0xFCU)
#define RXLUT_RLCIXSR_CIDS_SHIFT                 (2U)
#define RXLUT_RLCIXSR_CIDS_WIDTH                 (6U)
#define RXLUT_RLCIXSR_CIDS(x)                    (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCIXSR_CIDS_SHIFT)) & RXLUT_RLCIXSR_CIDS_MASK)

#define RXLUT_RLCIXSR_CTRLS_MASK                 (0x300U)
#define RXLUT_RLCIXSR_CTRLS_SHIFT                (8U)
#define RXLUT_RLCIXSR_CTRLS_WIDTH                (2U)
#define RXLUT_RLCIXSR_CTRLS(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCIXSR_CTRLS_SHIFT)) & RXLUT_RLCIXSR_CTRLS_MASK)

#define RXLUT_RLCIXSR_INDXS_MASK                 (0xFFFF0000U)
#define RXLUT_RLCIXSR_INDXS_SHIFT                (16U)
#define RXLUT_RLCIXSR_INDXS_WIDTH                (16U)
#define RXLUT_RLCIXSR_INDXS(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLCIXSR_INDXS_SHIFT)) & RXLUT_RLCIXSR_INDXS_MASK)
/*! @} */

/*! @name RLADRSR - RXLUT Address Status */
/*! @{ */

#define RXLUT_RLADRSR_ADDRS_MASK                 (0xFFFFU)
#define RXLUT_RLADRSR_ADDRS_SHIFT                (0U)
#define RXLUT_RLADRSR_ADDRS_WIDTH                (16U)
#define RXLUT_RLADRSR_ADDRS(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLADRSR_ADDRS_SHIFT)) & RXLUT_RLADRSR_ADDRS_MASK)
/*! @} */

/*! @name RLSRSR - RXLUT Search Result Status */
/*! @{ */

#define RXLUT_RLSRSR_AVLS_MASK                   (0x1FFFFU)
#define RXLUT_RLSRSR_AVLS_SHIFT                  (0U)
#define RXLUT_RLSRSR_AVLS_WIDTH                  (17U)
#define RXLUT_RLSRSR_AVLS(x)                     (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSRSR_AVLS_SHIFT)) & RXLUT_RLSRSR_AVLS_MASK)
/*! @} */

/*! @name RLIER - RXLUT Interrupt Enable */
/*! @{ */

#define RXLUT_RLIER_PS_AVLIE_MASK                (0x1U)
#define RXLUT_RLIER_PS_AVLIE_SHIFT               (0U)
#define RXLUT_RLIER_PS_AVLIE_WIDTH               (1U)
#define RXLUT_RLIER_PS_AVLIE(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLIER_PS_AVLIE_SHIFT)) & RXLUT_RLIER_PS_AVLIE_MASK)

#define RXLUT_RLIER_CIEIE_MASK                   (0x80000000U)
#define RXLUT_RLIER_CIEIE_SHIFT                  (31U)
#define RXLUT_RLIER_CIEIE_WIDTH                  (1U)
#define RXLUT_RLIER_CIEIE(x)                     (((uint32_t)(((uint32_t)(x)) << RXLUT_RLIER_CIEIE_SHIFT)) & RXLUT_RLIER_CIEIE_MASK)
/*! @} */

/*! @name RLISR - RXLUT Interrupt Status */
/*! @{ */

#define RXLUT_RLISR_PS_AVL_MASK                  (0x1U)
#define RXLUT_RLISR_PS_AVL_SHIFT                 (0U)
#define RXLUT_RLISR_PS_AVL_WIDTH                 (1U)
#define RXLUT_RLISR_PS_AVL(x)                    (((uint32_t)(((uint32_t)(x)) << RXLUT_RLISR_PS_AVL_SHIFT)) & RXLUT_RLISR_PS_AVL_MASK)

#define RXLUT_RLISR_CIE_MASK                     (0x80000000U)
#define RXLUT_RLISR_CIE_SHIFT                    (31U)
#define RXLUT_RLISR_CIE_WIDTH                    (1U)
#define RXLUT_RLISR_CIE(x)                       (((uint32_t)(((uint32_t)(x)) << RXLUT_RLISR_CIE_SHIFT)) & RXLUT_RLISR_CIE_MASK)
/*! @} */

/*! @name RLSR1 - RXLUT Status Register 1 */
/*! @{ */

#define RXLUT_RLSR1_PS_AVLS_MASK                 (0x1U)
#define RXLUT_RLSR1_PS_AVLS_SHIFT                (0U)
#define RXLUT_RLSR1_PS_AVLS_WIDTH                (1U)
#define RXLUT_RLSR1_PS_AVLS(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSR1_PS_AVLS_SHIFT)) & RXLUT_RLSR1_PS_AVLS_MASK)

#define RXLUT_RLSR1_CIES_MASK                    (0x80000000U)
#define RXLUT_RLSR1_CIES_SHIFT                   (31U)
#define RXLUT_RLSR1_CIES_WIDTH                   (1U)
#define RXLUT_RLSR1_CIES(x)                      (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSR1_CIES_SHIFT)) & RXLUT_RLSR1_CIES_MASK)
/*! @} */

/*! @name RLSICR - RXLUT Search Input Command */
/*! @{ */

#define RXLUT_RLSICR_CID_MASK                    (0x3FU)
#define RXLUT_RLSICR_CID_SHIFT                   (0U)
#define RXLUT_RLSICR_CID_WIDTH                   (6U)
#define RXLUT_RLSICR_CID(x)                      (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSICR_CID_SHIFT)) & RXLUT_RLSICR_CID_MASK)

#define RXLUT_RLSICR_SYNC_ID_MASK                (0x3FFF0000U)
#define RXLUT_RLSICR_SYNC_ID_SHIFT               (16U)
#define RXLUT_RLSICR_SYNC_ID_WIDTH               (14U)
#define RXLUT_RLSICR_SYNC_ID(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSICR_SYNC_ID_SHIFT)) & RXLUT_RLSICR_SYNC_ID_MASK)
/*! @} */

/*! @name RLSICFIR - RXLUT Search Input Command Frame ID */
/*! @{ */

#define RXLUT_RLSICFIR_FID_MASK                  (0xFFFFFFFFU)
#define RXLUT_RLSICFIR_FID_SHIFT                 (0U)
#define RXLUT_RLSICFIR_FID_WIDTH                 (32U)
#define RXLUT_RLSICFIR_FID(x)                    (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSICFIR_FID_SHIFT)) & RXLUT_RLSICFIR_FID_MASK)
/*! @} */

/*! @name RLSOIXR - RXLUT Search Output */
/*! @{ */

#define RXLUT_RLSOIXR_MS_MASK                    (0x1U)
#define RXLUT_RLSOIXR_MS_SHIFT                   (0U)
#define RXLUT_RLSOIXR_MS_WIDTH                   (1U)
#define RXLUT_RLSOIXR_MS(x)                      (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOIXR_MS_SHIFT)) & RXLUT_RLSOIXR_MS_MASK)

#define RXLUT_RLSOIXR_ENABLE_MASK                (0x2U)
#define RXLUT_RLSOIXR_ENABLE_SHIFT               (1U)
#define RXLUT_RLSOIXR_ENABLE_WIDTH               (1U)
#define RXLUT_RLSOIXR_ENABLE(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOIXR_ENABLE_SHIFT)) & RXLUT_RLSOIXR_ENABLE_MASK)

#define RXLUT_RLSOIXR_SYNC_ID_MASK               (0xFFFCU)
#define RXLUT_RLSOIXR_SYNC_ID_SHIFT              (2U)
#define RXLUT_RLSOIXR_SYNC_ID_WIDTH              (14U)
#define RXLUT_RLSOIXR_SYNC_ID(x)                 (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOIXR_SYNC_ID_SHIFT)) & RXLUT_RLSOIXR_SYNC_ID_MASK)

