zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_RXLUT.h
#define RXLUT_RLSOIXR_IDX_MASK                   (0xFFFF0000U)
#define RXLUT_RLSOIXR_IDX_SHIFT                  (16U)
#define RXLUT_RLSOIXR_IDX_WIDTH                  (16U)
#define RXLUT_RLSOIXR_IDX(x)                     (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOIXR_IDX_SHIFT)) & RXLUT_RLSOIXR_IDX_MASK)
/*! @} */

/*! @name RLSOADR - RXLUT Search Output Address */
/*! @{ */

#define RXLUT_RLSOADR_ADR_MASK                   (0xFFFFU)
#define RXLUT_RLSOADR_ADR_SHIFT                  (0U)
#define RXLUT_RLSOADR_ADR_WIDTH                  (16U)
#define RXLUT_RLSOADR_ADR(x)                     (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOADR_ADR_SHIFT)) & RXLUT_RLSOADR_ADR_MASK)
/*! @} */

/*! @name RLSICFSR - RXLUT Search Input Command FIFO Status */
/*! @{ */

#define RXLUT_RLSICFSR_EMPTY_MASK                (0x1U)
#define RXLUT_RLSICFSR_EMPTY_SHIFT               (0U)
#define RXLUT_RLSICFSR_EMPTY_WIDTH               (1U)
#define RXLUT_RLSICFSR_EMPTY(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSICFSR_EMPTY_SHIFT)) & RXLUT_RLSICFSR_EMPTY_MASK)

#define RXLUT_RLSICFSR_FULL_MASK                 (0x2U)
#define RXLUT_RLSICFSR_FULL_SHIFT                (1U)
#define RXLUT_RLSICFSR_FULL_WIDTH                (1U)
#define RXLUT_RLSICFSR_FULL(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSICFSR_FULL_SHIFT)) & RXLUT_RLSICFSR_FULL_MASK)
/*! @} */

/*! @name RLSOFSR - RXLUT Search Output FIFO Status */
/*! @{ */

#define RXLUT_RLSOFSR_EMPTY0_MASK                (0x1U)
#define RXLUT_RLSOFSR_EMPTY0_SHIFT               (0U)
#define RXLUT_RLSOFSR_EMPTY0_WIDTH               (1U)
#define RXLUT_RLSOFSR_EMPTY0(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY0_SHIFT)) & RXLUT_RLSOFSR_EMPTY0_MASK)

#define RXLUT_RLSOFSR_FULL0_MASK                 (0x2U)
#define RXLUT_RLSOFSR_FULL0_SHIFT                (1U)
#define RXLUT_RLSOFSR_FULL0_WIDTH                (1U)
#define RXLUT_RLSOFSR_FULL0(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL0_SHIFT)) & RXLUT_RLSOFSR_FULL0_MASK)

#define RXLUT_RLSOFSR_EMPTY1_MASK                (0x10U)
#define RXLUT_RLSOFSR_EMPTY1_SHIFT               (4U)
#define RXLUT_RLSOFSR_EMPTY1_WIDTH               (1U)
#define RXLUT_RLSOFSR_EMPTY1(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY1_SHIFT)) & RXLUT_RLSOFSR_EMPTY1_MASK)

#define RXLUT_RLSOFSR_FULL1_MASK                 (0x20U)
#define RXLUT_RLSOFSR_FULL1_SHIFT                (5U)
#define RXLUT_RLSOFSR_FULL1_WIDTH                (1U)
#define RXLUT_RLSOFSR_FULL1(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL1_SHIFT)) & RXLUT_RLSOFSR_FULL1_MASK)

#define RXLUT_RLSOFSR_EMPTY2_MASK                (0x100U)
#define RXLUT_RLSOFSR_EMPTY2_SHIFT               (8U)
#define RXLUT_RLSOFSR_EMPTY2_WIDTH               (1U)
#define RXLUT_RLSOFSR_EMPTY2(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY2_SHIFT)) & RXLUT_RLSOFSR_EMPTY2_MASK)

#define RXLUT_RLSOFSR_FULL2_MASK                 (0x200U)
#define RXLUT_RLSOFSR_FULL2_SHIFT                (9U)
#define RXLUT_RLSOFSR_FULL2_WIDTH                (1U)
#define RXLUT_RLSOFSR_FULL2(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL2_SHIFT)) & RXLUT_RLSOFSR_FULL2_MASK)

#define RXLUT_RLSOFSR_EMPTY3_MASK                (0x1000U)
#define RXLUT_RLSOFSR_EMPTY3_SHIFT               (12U)
#define RXLUT_RLSOFSR_EMPTY3_WIDTH               (1U)
#define RXLUT_RLSOFSR_EMPTY3(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY3_SHIFT)) & RXLUT_RLSOFSR_EMPTY3_MASK)

#define RXLUT_RLSOFSR_FULL3_MASK                 (0x2000U)
#define RXLUT_RLSOFSR_FULL3_SHIFT                (13U)
#define RXLUT_RLSOFSR_FULL3_WIDTH                (1U)
#define RXLUT_RLSOFSR_FULL3(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL3_SHIFT)) & RXLUT_RLSOFSR_FULL3_MASK)

#define RXLUT_RLSOFSR_EMPTY4_MASK                (0x10000U)
#define RXLUT_RLSOFSR_EMPTY4_SHIFT               (16U)
#define RXLUT_RLSOFSR_EMPTY4_WIDTH               (1U)
#define RXLUT_RLSOFSR_EMPTY4(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY4_SHIFT)) & RXLUT_RLSOFSR_EMPTY4_MASK)

#define RXLUT_RLSOFSR_FULL4_MASK                 (0x20000U)
#define RXLUT_RLSOFSR_FULL4_SHIFT                (17U)
#define RXLUT_RLSOFSR_FULL4_WIDTH                (1U)
#define RXLUT_RLSOFSR_FULL4(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL4_SHIFT)) & RXLUT_RLSOFSR_FULL4_MASK)

#define RXLUT_RLSOFSR_EMPTY5_MASK                (0x100000U)
#define RXLUT_RLSOFSR_EMPTY5_SHIFT               (20U)
#define RXLUT_RLSOFSR_EMPTY5_WIDTH               (1U)
#define RXLUT_RLSOFSR_EMPTY5(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY5_SHIFT)) & RXLUT_RLSOFSR_EMPTY5_MASK)

#define RXLUT_RLSOFSR_FULL5_MASK                 (0x200000U)
#define RXLUT_RLSOFSR_FULL5_SHIFT                (21U)
#define RXLUT_RLSOFSR_FULL5_WIDTH                (1U)
#define RXLUT_RLSOFSR_FULL5(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL5_SHIFT)) & RXLUT_RLSOFSR_FULL5_MASK)

#define RXLUT_RLSOFSR_EMPTY6_MASK                (0x1000000U)
#define RXLUT_RLSOFSR_EMPTY6_SHIFT               (24U)
#define RXLUT_RLSOFSR_EMPTY6_WIDTH               (1U)
#define RXLUT_RLSOFSR_EMPTY6(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY6_SHIFT)) & RXLUT_RLSOFSR_EMPTY6_MASK)

#define RXLUT_RLSOFSR_FULL6_MASK                 (0x2000000U)
#define RXLUT_RLSOFSR_FULL6_SHIFT                (25U)
#define RXLUT_RLSOFSR_FULL6_WIDTH                (1U)
#define RXLUT_RLSOFSR_FULL6(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL6_SHIFT)) & RXLUT_RLSOFSR_FULL6_MASK)

#define RXLUT_RLSOFSR_EMPTY7_MASK                (0x10000000U)
#define RXLUT_RLSOFSR_EMPTY7_SHIFT               (28U)
#define RXLUT_RLSOFSR_EMPTY7_WIDTH               (1U)
#define RXLUT_RLSOFSR_EMPTY7(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY7_SHIFT)) & RXLUT_RLSOFSR_EMPTY7_MASK)

