zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_RXLUT.h
#define RXLUT_RLSOFSR_FULL7_MASK                 (0x20000000U)
#define RXLUT_RLSOFSR_FULL7_SHIFT                (29U)
#define RXLUT_RLSOFSR_FULL7_WIDTH                (1U)
#define RXLUT_RLSOFSR_FULL7(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL7_SHIFT)) & RXLUT_RLSOFSR_FULL7_MASK)

#define RXLUT_RLSOFSR_EMPTY8_MASK                (0x1U)
#define RXLUT_RLSOFSR_EMPTY8_SHIFT               (0U)
#define RXLUT_RLSOFSR_EMPTY8_WIDTH               (1U)
#define RXLUT_RLSOFSR_EMPTY8(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY8_SHIFT)) & RXLUT_RLSOFSR_EMPTY8_MASK)

#define RXLUT_RLSOFSR_FULL8_MASK                 (0x2U)
#define RXLUT_RLSOFSR_FULL8_SHIFT                (1U)
#define RXLUT_RLSOFSR_FULL8_WIDTH                (1U)
#define RXLUT_RLSOFSR_FULL8(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL8_SHIFT)) & RXLUT_RLSOFSR_FULL8_MASK)

#define RXLUT_RLSOFSR_EMPTY9_MASK                (0x10U)
#define RXLUT_RLSOFSR_EMPTY9_SHIFT               (4U)
#define RXLUT_RLSOFSR_EMPTY9_WIDTH               (1U)
#define RXLUT_RLSOFSR_EMPTY9(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY9_SHIFT)) & RXLUT_RLSOFSR_EMPTY9_MASK)

#define RXLUT_RLSOFSR_FULL9_MASK                 (0x20U)
#define RXLUT_RLSOFSR_FULL9_SHIFT                (5U)
#define RXLUT_RLSOFSR_FULL9_WIDTH                (1U)
#define RXLUT_RLSOFSR_FULL9(x)                   (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL9_SHIFT)) & RXLUT_RLSOFSR_FULL9_MASK)

#define RXLUT_RLSOFSR_EMPTY10_MASK               (0x100U)
#define RXLUT_RLSOFSR_EMPTY10_SHIFT              (8U)
#define RXLUT_RLSOFSR_EMPTY10_WIDTH              (1U)
#define RXLUT_RLSOFSR_EMPTY10(x)                 (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY10_SHIFT)) & RXLUT_RLSOFSR_EMPTY10_MASK)

#define RXLUT_RLSOFSR_FULL10_MASK                (0x200U)
#define RXLUT_RLSOFSR_FULL10_SHIFT               (9U)
#define RXLUT_RLSOFSR_FULL10_WIDTH               (1U)
#define RXLUT_RLSOFSR_FULL10(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL10_SHIFT)) & RXLUT_RLSOFSR_FULL10_MASK)

#define RXLUT_RLSOFSR_EMPTY11_MASK               (0x1000U)
#define RXLUT_RLSOFSR_EMPTY11_SHIFT              (12U)
#define RXLUT_RLSOFSR_EMPTY11_WIDTH              (1U)
#define RXLUT_RLSOFSR_EMPTY11(x)                 (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY11_SHIFT)) & RXLUT_RLSOFSR_EMPTY11_MASK)

#define RXLUT_RLSOFSR_FULL11_MASK                (0x2000U)
#define RXLUT_RLSOFSR_FULL11_SHIFT               (13U)
#define RXLUT_RLSOFSR_FULL11_WIDTH               (1U)
#define RXLUT_RLSOFSR_FULL11(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL11_SHIFT)) & RXLUT_RLSOFSR_FULL11_MASK)

#define RXLUT_RLSOFSR_EMPTY12_MASK               (0x10000U)
#define RXLUT_RLSOFSR_EMPTY12_SHIFT              (16U)
#define RXLUT_RLSOFSR_EMPTY12_WIDTH              (1U)
#define RXLUT_RLSOFSR_EMPTY12(x)                 (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY12_SHIFT)) & RXLUT_RLSOFSR_EMPTY12_MASK)

#define RXLUT_RLSOFSR_FULL12_MASK                (0x20000U)
#define RXLUT_RLSOFSR_FULL12_SHIFT               (17U)
#define RXLUT_RLSOFSR_FULL12_WIDTH               (1U)
#define RXLUT_RLSOFSR_FULL12(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL12_SHIFT)) & RXLUT_RLSOFSR_FULL12_MASK)

#define RXLUT_RLSOFSR_EMPTY13_MASK               (0x100000U)
#define RXLUT_RLSOFSR_EMPTY13_SHIFT              (20U)
#define RXLUT_RLSOFSR_EMPTY13_WIDTH              (1U)
#define RXLUT_RLSOFSR_EMPTY13(x)                 (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY13_SHIFT)) & RXLUT_RLSOFSR_EMPTY13_MASK)

#define RXLUT_RLSOFSR_FULL13_MASK                (0x200000U)
#define RXLUT_RLSOFSR_FULL13_SHIFT               (21U)
#define RXLUT_RLSOFSR_FULL13_WIDTH               (1U)
#define RXLUT_RLSOFSR_FULL13(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL13_SHIFT)) & RXLUT_RLSOFSR_FULL13_MASK)

#define RXLUT_RLSOFSR_EMPTY14_MASK               (0x1000000U)
#define RXLUT_RLSOFSR_EMPTY14_SHIFT              (24U)
#define RXLUT_RLSOFSR_EMPTY14_WIDTH              (1U)
#define RXLUT_RLSOFSR_EMPTY14(x)                 (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY14_SHIFT)) & RXLUT_RLSOFSR_EMPTY14_MASK)

#define RXLUT_RLSOFSR_FULL14_MASK                (0x2000000U)
#define RXLUT_RLSOFSR_FULL14_SHIFT               (25U)
#define RXLUT_RLSOFSR_FULL14_WIDTH               (1U)
#define RXLUT_RLSOFSR_FULL14(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL14_SHIFT)) & RXLUT_RLSOFSR_FULL14_MASK)

#define RXLUT_RLSOFSR_EMPTY15_MASK               (0x10000000U)
#define RXLUT_RLSOFSR_EMPTY15_SHIFT              (28U)
#define RXLUT_RLSOFSR_EMPTY15_WIDTH              (1U)
#define RXLUT_RLSOFSR_EMPTY15(x)                 (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY15_SHIFT)) & RXLUT_RLSOFSR_EMPTY15_MASK)

#define RXLUT_RLSOFSR_FULL15_MASK                (0x20000000U)
#define RXLUT_RLSOFSR_FULL15_SHIFT               (29U)
#define RXLUT_RLSOFSR_FULL15_WIDTH               (1U)
#define RXLUT_RLSOFSR_FULL15(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL15_SHIFT)) & RXLUT_RLSOFSR_FULL15_MASK)

#define RXLUT_RLSOFSR_EMPTY16_MASK               (0x1U)
#define RXLUT_RLSOFSR_EMPTY16_SHIFT              (0U)
#define RXLUT_RLSOFSR_EMPTY16_WIDTH              (1U)
#define RXLUT_RLSOFSR_EMPTY16(x)                 (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_EMPTY16_SHIFT)) & RXLUT_RLSOFSR_EMPTY16_MASK)

#define RXLUT_RLSOFSR_FULL16_MASK                (0x2U)
#define RXLUT_RLSOFSR_FULL16_SHIFT               (1U)
#define RXLUT_RLSOFSR_FULL16_WIDTH               (1U)
#define RXLUT_RLSOFSR_FULL16(x)                  (((uint32_t)(((uint32_t)(x)) << RXLUT_RLSOFSR_FULL16_SHIFT)) & RXLUT_RLSOFSR_FULL16_MASK)
/*! @} */

/*! @name RLER - RXLUT Error */
/*! @{ */

#define RXLUT_RLER_SBIT_MASK                     (0x3U)
#define RXLUT_RLER_SBIT_SHIFT                    (0U)
#define RXLUT_RLER_SBIT_WIDTH                    (2U)
#define RXLUT_RLER_SBIT(x)                       (((uint32_t)(((uint32_t)(x)) << RXLUT_RLER_SBIT_SHIFT)) & RXLUT_RLER_SBIT_MASK)

#define RXLUT_RLER_MBIT_MASK                     (0x30000U)
#define RXLUT_RLER_MBIT_SHIFT                    (16U)
#define RXLUT_RLER_MBIT_WIDTH                    (2U)
#define RXLUT_RLER_MBIT(x)                       (((uint32_t)(((uint32_t)(x)) << RXLUT_RLER_MBIT_SHIFT)) & RXLUT_RLER_MBIT_MASK)
/*! @} */

/*! @name RLOOR - RXLUT Output Overflow */
/*! @{ */

#define RXLUT_RLOOR_LOR_MASK                     (0x1FFFFU)
#define RXLUT_RLOOR_LOR_SHIFT                    (0U)
#define RXLUT_RLOOR_LOR_WIDTH                    (17U)
#define RXLUT_RLOOR_LOR(x)                       (((uint32_t)(((uint32_t)(x)) << RXLUT_RLOOR_LOR_SHIFT)) & RXLUT_RLOOR_LOR_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group RXLUT_Register_Masks */

/*!
 * @}
 */ /* end of group RXLUT_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_RXLUT_H_) */
